---
kind: method
id: M:Autodesk.Revit.DB.RuledSurface.HasFirstProfilePoint
source: html/f6049f89-38db-e9a8-9a09-f91809f59f64.htm
---
# Autodesk.Revit.DB.RuledSurface.HasFirstProfilePoint Method

Checks if a point was used to define the first profile.

## Syntax (C#)
```csharp
public bool HasFirstProfilePoint()
```

## Returns
True if a point was used to define the first profile, false otherwise.